{
  "a psalm for the wild-built|becky chambers": {
    "title": "A Psalm for the Wild-Built",
    "description": "It's been centuries since the robots of Panga gained self-awareness and laid down their tools; centuries since they wandered, en masse, into the wilderness, never to be seen again; centuries since they faded into myth and urban legend.\r\n\r\nOne day, the life of a tea monk is upended by the arrival of a robot, there to honor the old promise of checking in. The robot cannot go back until the question of \"what do people need?\" is answered.\r\n\r\nBut the answer to that question depends on who you ask, and how.\r\n\r\nThey're going to need to ask it *a lot.*\r\n\r\nBecky Chambers's new series asks: in a world where people have what they want, does having more matter?",
    "author": "Becky Chambers",
    "publishedDate": "2021",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "language": "ita",
    "fetchedAt": 1770195993027
  },
  "bat eater and other names for cora zeng|kylie lee baker": {
    "title": "Bat Eater and Other Names for Cora Zeng",
    "description": null,
    "author": "Kylie Lee Baker",
    "publishedDate": "2025",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "language": "eng",
    "fetchedAt": 1770195993604
  },
  "coffin moon|keith rosson": {
    "title": "Coffin Moon",
    "description": "From the author of the “exciting, suspenseful, horrifying” (Stephen King) Fever House, a Vietnam veteran and his adopted niece hunt—and are hunted by—the vampire that slaughtered their family. “Grabs you by the throat and doesn’t relent.”—Cassandra Khaw, author of Nothing But Blackened Teeth It’s the winter of 1975, and Portland, Oregon, is all sleet and neon. Duane Minor is back home after a tour in Vietnam, a bartender just trying to stay sober; save his marriage with his wife, Heidi; and connect with his thirteen-year-old niece, Julia, now that he’s responsible for raising her. Things aren’t easy, but Minor is scraping by. Then a vampire walks into his bar and ruins his life. When Minor crosses John Varley, a killer who sleeps during the day beneath loose drifts of earth and grows teeth in the light of the moon, Varley brutally retaliates by murdering Heidi, leaving Minor broken with guilt and Julia filled with rage. What’s left of their splintered family is united by only one desire: vengeance. So begins a furious, frenzied pursuit across the Pacific Northwest and beyond. From grimy alleyways to desolate highways to snow-lashed plains, Minor and Julia are cast into the dark orbit of undead children, silver bullet casters, and the bevy of broken men transfixed by Varley’s ferocity. Everyone’s out for blood. Gritty, unforgettable, and emotionally devastating, Coffin Moon asks what will be left of our humanity when grief transmutes into violence, when monsters wear human faces, and when our thirst for revenge eclipses everything else.",
    "author": "Keith Rosson",
    "publishedDate": "2025-09-09",
    "publisher": "Random House",
    "pageCount": 321,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "language": "en",
    "fetchedAt": 1770195993960
  },
  "full speed to a crash landing|": {
    "title": "Full Speed to a Crash Landing",
    "description": null,
    "author": "Beth Revis",
    "publishedDate": "2024",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "language": "eng",
    "fetchedAt": 1770195994425
  },
  "we are legion|dennis e. taylor": {
    "title": "We Are Legion",
    "description": "“Bob Johansson has just sold his software company and is looking forward to a life of leisure. There are places to go, books to read, and movies to watch. So it's a little unfair when he gets himself killed crossing the street.\r\n\r\nBob wakes up a century later to find that corpsicles have been declared to be without rights, and he is now the property of the state. He has been uploaded into computer hardware and is slated to be the controlling AI in an interstellar probe looking for habitable planets. The stakes are high: no less than the first claim to entire worlds. If he declines the honor, he'll be switched off, and they'll try again with someone else. If he accepts, he becomes a prime target. There are at least three other countries trying to get their own probes launched first, and they play dirty.\r\n\r\nThe safest place for Bob is in space, heading away from Earth at top speed. Or so he thinks. Because the universe is full of nasties, and trespassers make them mad - very mad.”—Goodreads\r\n\r\nBobiverse Series:\r\n1. **[We Are Legion: (We Are Bob)](/works/OL19123425W)**\r\n2. [For We Are Many](/works/OL19742648W)\r\n3. [All These Worlds](/works/OL19742647W)\r\n4. [Heaven’s River](/works/OL23705087W)",
    "author": "Dennis E. Taylor",
    "publishedDate": "2016",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "language": "eng",
    "fetchedAt": 1770195994859
  }
}