{
  "a psalm for the wild-built|becky chambers": {
    "description": "It's been centuries since the robots of Panga gained self-awareness and laid down their tools; centuries since they wandered, en masse, into the wilderness, never to be seen again; centuries since they faded into myth and urban legend.\r\n\r\nOne day, the life of a tea monk is upended by the arrival of a robot, there to honor the old promise of checking in. The robot cannot go back until the question of \"what do people need?\" is answered.\r\n\r\nBut the answer to that question depends on who you ask, and how.\r\n\r\nThey're going to need to ask it *a lot.*\r\n\r\nBecky Chambers's new series asks: in a world where people have what they want, does having more matter?",
    "rating": null,
    "ratingsCount": null,
    "author": "Becky Chambers",
    "publishedDate": "2021",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "ita",
    "fetchedAt": 1770105977933
  },
  "bat eater and other names for cora zeng - kylie lee baker.epub|kylie lee baker": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": "Kylie Lee Baker",
    "publishedDate": "2015-07-29",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": "1320509215",
    "isbn13": "9781320509213",
    "language": "en",
    "fetchedAt": 1770108185152
  },
  "coffin moon - keith rosson.epub|keith rosson": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": null,
    "publishedDate": null,
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": null,
    "fetchedAt": 1770105978858
  },
  "full speed to a crash landing|beth revis": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": "Beth Revis",
    "publishedDate": "2024",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "eng",
    "fetchedAt": 1770107569038
  },
  "we are legion|dennis e. taylor": {
    "description": "“Bob Johansson has just sold his software company and is looking forward to a life of leisure. There are places to go, books to read, and movies to watch. So it's a little unfair when he gets himself killed crossing the street.\r\n\r\nBob wakes up a century later to find that corpsicles have been declared to be without rights, and he is now the property of the state. He has been uploaded into computer hardware and is slated to be the controlling AI in an interstellar probe looking for habitable planets. The stakes are high: no less than the first claim to entire worlds. If he declines the honor, he'll be switched off, and they'll try again with someone else. If he accepts, he becomes a prime target. There are at least three other countries trying to get their own probes launched first, and they play dirty.\r\n\r\nThe safest place for Bob is in space, heading away from Earth at top speed. Or so he thinks. Because the universe is full of nasties, and trespassers make them mad - very mad.”—Goodreads\r\n\r\nBobiverse Series:\r\n1. **[We Are Legion: (We Are Bob)](/works/OL19123425W)**\r\n2. [For We Are Many](/works/OL19742648W)\r\n3. [All These Worlds](/works/OL19742647W)\r\n4. [Heaven’s River](/works/OL23705087W)",
    "rating": null,
    "ratingsCount": null,
    "author": "Dennis E. Taylor",
    "publishedDate": "2016",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "eng",
    "fetchedAt": 1770105980084
  },
  "a confederacy of dunces|john kennedy toole": {
    "description": "Released by Louisiana State University Press in 1980, A Confederacy of Dunces is nothing short of a publishing phenomenon. Rejected by countless publishers and submitted by the author's mother years after his suicide, the book won the 1981 Pulitzer Prize for Fiction. Today there are almost two million copies in print worldwide in eighteen languages. Now, for the first time, John Kennedy Toole's comic masterpiece is available in a large print edition. Toole's lunatic and sage novel introduces one of the most memorable characters in American literature, Ignatius Reilly, whom Walker Percy dubs \"slob extraordinaire, a mad Oliver Hardy, a fat Don Quixote, a perverse Thomas Aquinas rolled into one.\" Set in New Orleans, A Confederacy of Dunces outswifts Swift, one of whose essays gives the book its title. As its characters burst into life, they leave the region and literature forever changed by their presence -- Ignatius and his mother; Miss Trixie, the octogenarian assistant accountant at Levi Pants; inept, wan Patrolman Mancuso; Darlene, the Bourbon Street stripper with a penchant for poultry; Jones the jivecat in spaceage dark glasses. Included here is the introduction that writer and New Orleans resident Andrei Codrescu composed for the book's twentieth anniversary. Set in oversized type for ease in reading, the large print edition will gratify both first-timers seeking to discover this modern-day classic and longtime afficionados wishing to reread a favorite novel.",
    "rating": 4,
    "ratingsCount": 67,
    "author": "John Kennedy Toole",
    "publishedDate": "2004-09-01",
    "publisher": "LSU Press",
    "pageCount": 636,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0807130087",
    "isbn13": "9780807130087",
    "language": "en",
    "fetchedAt": 1770107726412
  },
  "a man named doll|jonathan ames": {
    "description": "In this deliciously noir novel from the creator of HBO's Bored to Death, idiosyncratic private detective Happy Doll embarks on a quest to help a dying friend in a sun-blinded Los Angeles as \"quirky, edgy, charming, funny and serious\" as its protagonist (Lee Child). Happy Doll is a charming, if occasionally inexpert, private detective living just one sheer cliff drop beneath the Hollywood sign with his beloved half-Chihuahua half-Terrier, George. A veteran of both the Navy and LAPD, Doll supplements his meager income as a P.I. by working through the night at a local Thai spa that offers its clients a number of special services. Armed with his sixteen-inch steel telescopic baton, biting dry humor, and just a bit of a hero complex, the ex-cop sets out to protect the women who work there from clients who have trouble understanding the word \"no.\" Doll gets by just fine following his two basic rules: bark loudly and act first. But when things get out-of-hand with one particularly violent patron, even he finds himself wildly out of his depth, and then things take an even more dangerous twist when an old friend from his days as a cop shows up at his door with a bullet in his gut. A Man Named Doll is more than just a fascinating introduction to one truly singular character, it is a highly addictive and completely unpredictable joyride through the sensuous and violent streets of LA.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jonathan Ames",
    "publishedDate": "2021-04-20",
    "publisher": "Mulholland Books",
    "pageCount": 188,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316703648",
    "isbn13": "9780316703642",
    "language": "en",
    "fetchedAt": 1770107726767
  },
  "a wild sheep chase|haruki murakami": {
    "description": "A New York Times bestselling author—and “a mythmaker for the millennium, a wiseacre wiseman” (New York Times Book Review)—delivers a surreal and elaborate quest that takes readers from Tokyo to the remote mountains of northern Japan, where the unnamed protagonist has a surprising confrontation with his demons. An advertising executive receives a postcard from a friend and casually appropriates the image for an advertisement. What he doesn’t realize is that included in the scene is a mutant sheep with a star on its back, and in using this photo he has unwittingly captured the attention of a man who offers a menacing ultimatum: find the sheep or face dire consequences.",
    "rating": 4.5,
    "ratingsCount": 4,
    "author": "Haruki Murakami",
    "publishedDate": "2010-09-01",
    "publisher": "Vintage",
    "pageCount": 364,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0307762726",
    "isbn13": "9780307762726",
    "language": "en",
    "fetchedAt": 1770107727223
  },
  "abaddon's gate|james s. a. corey": {
    "description": "The third book in the New York Times bestselling Expanse series, Abaddon's Gate opens the door to the ruins of an alien gate network—and the crew of the Rocinante may hold the key to unlocking its secrets. Now a Prime Original series. For generations, the solar system—Mars, the Moon, the Asteroid Belt—was humanity's great frontier. Until now. The alien artifact working through its program under the clouds of Venus has appeared in Uranus's orbit, where it has built a massive gate that leads to a starless dark. Jim Holden and the crew of the Rocinante are part of a vast flotilla of scientific and military ships going out to examine the artifact. But behind the scenes, a complex plot is unfolding, with the destruction of Holden at its core. As the emissaries of the human race try to find whether the gate is an opportunity or a threat, the greatest danger is the one they brought with them. Abaddon's Gate is a breakneck science fiction adventure following the critically acclaimed Caliban's War. \"Interplanetary adventure the way it ought to be written.\" —George R. R. Martin Hugo Award Winner for Best Series The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​ Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers​",
    "rating": 3.5,
    "ratingsCount": 4,
    "author": "James S. A. Corey",
    "publishedDate": "2013-06-04",
    "publisher": "Orbit",
    "pageCount": 330,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316235423",
    "isbn13": "9780316235426",
    "language": "en",
    "fetchedAt": 1770107727617
  },
  "all the pretty horses|cormac mccarthy": {
    "description": "NATIONAL BOOK AWARD WINNER • NATIONAL BESTSELLER • The first volume in the Border Trilogy, from the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road All the Pretty Horses is the tale of John Grady Cole, who at sixteen finds himself at the end of a long line of Texas ranchers, cut off from the only life he has ever imagined for himself. With two companions, he sets off for Mexico on a sometimes idyllic, sometimes comic journey to a place where dreams are paid for in blood.",
    "rating": null,
    "ratingsCount": null,
    "author": "Cormac McCarthy",
    "publishedDate": "1993-06-29",
    "publisher": "Vintage",
    "pageCount": 322,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0679744398",
    "isbn13": "9780679744399",
    "language": "en",
    "fetchedAt": 1770107727982
  },
  "aquanaut|rick stanton": {
    "description": "THE ENTHRALLING INSIDE STORY OF THE THAI CAVE RESCUE NOW CHRONICLED IN NATIONAL GEOGRAPHIC HIT DOCUMENTARY THE RESCUE WRITTEN BY THE MAN AT THE HEART OF THE MISSION 'The British divers are all heroes' Clive Cussler 'A case study in courage' Ron Howard, Oscar-winning director of Apollo 13 ________ Thailand, July 2018. Twelve boys and their football coach vanish into Tham Luang caves just as the monsoon rains hit. A mile from the surface they are trapped by rising flood waters. All attempts to reach them fail. As hope for their survival fades a retired British firefighter tinkering with homemade cave-diving kit gets a call. Rick Stanton and his dive partner race to the other side of the world. The boys have been missing for days. Each hour, their chance of escape shrinks . . . Rick must swim, crawl and squeeze through treacherously tight submerged tunnels hunting for them. But that is not the impossible part. Because if by some miracle they're alive then somehow he must bring the boys back out again . . . He doesn't know it yet but all his life he's been training for this very moment . . . ________ 'Diver Rick Stanton relives the rescue of the century' SUNDAY TIMES 'This is their riveting, behind-the-scenes story. Captivating' SUNDAY POST THE RESCUE WATCHED BY THE WORLD 'The Thai cave rescue was phenomenally dangerous, and the work of true heroes' iNews '[The rescue] was fantastic, it really was . . .' HRH Prince William 'If it was me stuck anywhere, the one person I would want to come and rescue me is Rick Stanton' Alex Daw, Watch Commander, West Midlands Fire Service 'One of the great stories of our time' Elizabeth Chai Vasarhelyi, Oscar-winning co-director of Free Solo 'Rick Stanton is not the most domesticated of men' Sunday Telegraph",
    "rating": null,
    "ratingsCount": null,
    "author": "Rick Stanton",
    "publishedDate": "2021-06-10",
    "publisher": "Penguin UK",
    "pageCount": 369,
    "genres": [
      "Biography & Autobiography"
    ],
    "series": null,
    "isbn10": "1405944110",
    "isbn13": "9781405944113",
    "language": "en",
    "fetchedAt": 1770107728683
  },
  "artemis|andy weir": {
    "description": "NEW YORK TIMES BESTSELLER • From the renowned author of Project Hail Mary and The Martian comes a “propulsive” (NPR) tale of science, suspense, and humor—a heist story set on the moon. “An action-packed techno-thriller of the first order.”—USA Today Jasmine Bashara never signed up to be a hero. She just wanted to get rich. Not crazy, eccentric-billionaire rich, like many of the visitors to her hometown of Artemis, humanity’s first and only lunar colony. Just rich enough to move out of her coffin-sized apartment and eat something better than flavored algae. Rich enough to pay off a debt she’s owed for a long time. So when a chance at a huge score finally comes her way, Jazz can’t say no. But engineering the perfect crime is just the start of her problems—because her little heist is about to land her in the middle of a conspiracy for control of Artemis herself. Trapped between competing forces, pursued by a killer and the law alike, she’ll have to hatch a truly spectacular scheme to have a chance at staying alive and saving her city. Jazz is no hero, but she is a very good criminal. That’ll have to do.",
    "rating": 4.5,
    "ratingsCount": 2,
    "author": "Andy Weir",
    "publishedDate": "2017-11-14",
    "publisher": "Ballantine Books",
    "pageCount": 369,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0553448137",
    "isbn13": "9780553448139",
    "language": "en",
    "fetchedAt": 1770107729237
  },
  "bad things happen|harry dolan": {
    "description": "A gripping novel about a man trying to escape his violent past and soon becomes a murder suspect when a publisher—and the husband of the woman he's having an affair with—turns up dead. The man who calls himself David Loogan is hoping to escape a violent past by living a quiet, anonymous life in Ann Arbor, Michigan. But when he's hired as an editor at a mystery magazine, he is drawn into an affair with the sleek blond wife of the publisher, Tom Kristoll—a man who soon turns up dead. Elizabeth Waishkey is the most talented detective in the Ann Arbor Police Department, but even she doesn't know if Loogan is a killer or an ally who might help her find the truth. As more deaths start mounting up—some of them echoing stories published in the magazine—it's up to Elizabeth to solve both the murders and the mystery of Loogan himself. \"Witty, sophisticated, suspenseful and endless fun...the best first novel I've read this year.\" —Washington Post \"A hypnotically readable novel, with...dialog worthy of Elmore Leonard.\"—Douglas Preston \"Fans of Peter Abrahams and Scott Turow will find a lot to like.\"—Publishers Weekly (starred review)",
    "rating": null,
    "ratingsCount": null,
    "author": "Harry Dolan",
    "publishedDate": "2010-06-16",
    "publisher": "National Geographic Books",
    "pageCount": null,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0425234401",
    "isbn13": "9780425234402",
    "language": "en",
    "fetchedAt": 1770107729597
  },
  "blood meridian|cormac mccarthy": {
    "description": "One of The Atlantic’s “Great American Novels of the Past 100 Years,” now with a new foreword by Marlon James Widely considered one of the finest novels by a living writer, Blood Meridian is an epic tale of the violence and corruption that attended America’s westward expansion, brilliantly subverting the conventions of the Western novel and the mythology of the “Wild West.” Its wounded hero, the Kid, a fourteen-year-old Tennessean, must confront the extraordinary brutality of the Glanton gang, a murderous cadre on an official mission to scalp Indians. Seeming to preside over this nightmarish world is the diabolical Judge Holden, one of the most unforgettable characters in American fiction. Based on historical events that took place on the Texas-Mexico border in the 1850s, Blood Meridian represents a genius vision of the historical West, one whose stature has only grown in the years since its publication.",
    "rating": null,
    "ratingsCount": null,
    "author": "Cormac McCarthy",
    "publishedDate": "1992-05-05",
    "publisher": "Vintage",
    "pageCount": 369,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0679728759",
    "isbn13": "9780679728757",
    "language": "en",
    "fetchedAt": 1770107730019
  },
  "bonk|mary roach": {
    "description": "The bestselling author of \"Stiff\" turns her outrageous curiosity and infectious wit on the most alluring scientific subject of all: sex. 16 illustrations.",
    "rating": null,
    "ratingsCount": null,
    "author": "Mary Roach",
    "publishedDate": "2009-03-24",
    "publisher": "W. W. Norton & Company",
    "pageCount": 327,
    "genres": [
      "Health & Fitness"
    ],
    "series": null,
    "isbn10": "0393334791",
    "isbn13": "9780393334791",
    "language": "en",
    "fetchedAt": 1770107730388
  },
  "born to run|christopher mcdougall": {
    "description": "NATIONAL BESTSELLER • The astonishing and hugely entertaining story that completely changed the way we run. An epic adventure that began with one simple question: Why does my foot hurt? “Equal parts quest, physiology treatise, and running history.... The climactic race reads like a sprint.... It simply makes you want to run.” —Outside Magazine Isolated by Mexico's deadly Copper Canyons, the blissful Tarahumara Indians have honed the ability to run hundreds of miles without rest or injury. In a riveting narrative, award-winning journalist and often-injured runner Christopher McDougall sets out to discover their secrets. In the process, he takes his readers from science labs at Harvard to the sun-baked valleys and freezing peaks across North America, where ever-growing numbers of ultra-runners are pushing their bodies to the limit, and, finally, to a climactic race in the Copper Canyons that pits America’s best ultra-runners against the tribe. McDougall’s incredible story will not only engage your mind but inspire your body when you realize that you, indeed all of us, were born to run. Look for Born to Run 2, out now!",
    "rating": null,
    "ratingsCount": null,
    "author": "Christopher McDougall",
    "publishedDate": "2009-05-05",
    "publisher": "Knopf",
    "pageCount": 305,
    "genres": [
      "Sports & Recreation"
    ],
    "series": null,
    "isbn10": "0307266303",
    "isbn13": "9780307266309",
    "language": "en",
    "fetchedAt": 1770107730790
  },
  "caliban's war|james s. a. corey": {
    "description": "With over 10 million copies sold, The Expanse has become one of the biggest science fiction phenomenons of the decade. The second book in the New York Times bestselling Expanse series, Caliban's War shows a solar system on the brink of war, and the only hope of peace rests on James Holden and the crew of the Rocinante's shoulders. Now a Prime Original series. We are not alone. On Ganymede, breadbasket of the outer planets, a Martian marine watches as her platoon is slaughtered by a monstrous supersoldier. On Earth, a high-level politician struggles to prevent interplanetary war from reigniting. And on Venus, an alien protomolecule has overrun the planet, wreaking massive, mysterious changes and threatening to spread out into the solar system. In the vast wilderness of space, James Holden and the crew of the Rocinante have been keeping the peace for the Outer Planets Alliance. When they agree to help a scientist search war-torn Ganymede for a missing child, the future of humanity rests on whether a single ship can prevent an alien invasion that may have already begun . . . Hugo Award Winner for Best Series The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​ Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers​",
    "rating": 4.5,
    "ratingsCount": 12,
    "author": "James S. A. Corey",
    "publishedDate": "2012-06-26",
    "publisher": "Orbit",
    "pageCount": 352,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316202274",
    "isbn13": "9780316202275",
    "language": "en",
    "fetchedAt": 1770107731179
  },
  "cannery row|john steinbeck": {
    "description": "It all begins with a letter. Fall in love with Penguin Drop Caps, a new series of twenty-six collectible and hardcover editions, each with a type cover showcasing a gorgeously illustrated letter of the alphabet. In a design collaboration between Jessica Hische and Penguin Art Director Paul Buckley, the series features unique cover art by Hische, a superstar in the world of type design and illustration, whose work has appeared everywhere from Tiffany & Co. to Wes Anderson's recent film Moonrise Kingdom to Penguin's own bestsellers Committed and Rules of Civility. With exclusive designs that have never before appeared on Hische's hugely popular Daily Drop Cap blog, the Penguin Drop Caps series debuted with an 'A' for Jane Austen's Pride and Prejudice, a 'B' for Charlotte Brönte's Jane Eyre, and a 'C' for Willa Cather's My Ántonia. It continues with more perennial classics, perfect to give as elegant gifts or to showcase on your own shelves. S is for Steinbeck. Unburdened by the material necessities of the more fortunate, the denizens of Cannery Row discover rewards unknown in more traditional society. Henry the painter sorts through junk lots for pieces of wood to incorporate into the boat he is building, while the girls from Dora Flood’s bordello venture out now and then to enjoy a bit of sunshine. Lee Chong stocks his grocery with almost anything a man could want, and Doc, a young marine biologist who ministers to sick puppies and unhappy souls, unexpectedly finds true love. Cannery Row is just a few blocks long, but the story it harbors is suffused with warmth, understanding, and a great fund of human values. First published in 1945, and drawn from Steinbeck's memories of real inhabitants of Monterey, California, Cannery Row focuses on the acceptance of life as it is—both the loneliness of the individual and the exuberance of community.",
    "rating": null,
    "ratingsCount": null,
    "author": "John Steinbeck",
    "publishedDate": "2014-04-23",
    "publisher": "Penguin",
    "pageCount": 225,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0143125214",
    "isbn13": "9780143125211",
    "language": "en",
    "fetchedAt": 1770107731626
  },
  "child of god|cormac mccarthy": {
    "description": "From the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road • In this taut, chilling story, Lester Ballard—a violent, dispossessed man falsely accused of rape—haunts the hill country of East Tennessee when he is released from jail. While telling his story, Cormac McCarthy depicts the most sordid aspects of life with dignity, humor, and characteristic lyrical brilliance. \"Like the novelists he admires-Melville, Dostoyevsky, Faulkner-Cormac McCarthy has created an imaginative oeuvre greater and deeper than any single book. Such writers wrestle with the gods themselves.\" —Washington Post",
    "rating": null,
    "ratingsCount": null,
    "author": "Cormac McCarthy",
    "publishedDate": "1993-06-29",
    "publisher": "Vintage",
    "pageCount": 209,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0679728740",
    "isbn13": "9780679728740",
    "language": "en",
    "fetchedAt": 1770107731992
  },
  "cibola burn|james s. a. corey": {
    "description": "The gates have opened the way to thousands of habitable planets, and the land rush has begun. Settlers stream out from humanity's home planets in a vast, poorly controlled flood, landing on a new world. Among them, the Rocinante, haunted by the vast, posthuman network of the protomolecule as they investigate what destroyed the great intergalactic society that built the gates and the protomolecule. But Holden and his crew must also contend with the growing tensions between the settlers and the company which owns the official claim to the planet. Both sides will stop at nothing to defend what's theirs, but soon a terrible disease strikes and only Holden - with help from the ghostly Detective Miller - can find the cure.",
    "rating": null,
    "ratingsCount": null,
    "author": "James S. A. Corey",
    "publishedDate": "2014-08-06",
    "publisher": null,
    "pageCount": 348,
    "genres": [
      "FICTION"
    ],
    "series": null,
    "isbn10": "031640246X",
    "isbn13": "9780316402460",
    "language": "en",
    "fetchedAt": 1770107732524
  },
  "clear and present danger|tom clancy": {
    "description": "At the end of the prologue to Clear and Present Danger, Clancy writes, \"And so began something that had not quite begun and would not soon end, with many people in many places moving off in directions and on missions which they all mistakenly thought they understood. That was just as well. The future was too fearful for contemplation, and beyond the expected, illusory finish lines were things fated by the decisions made this morning--and, once decided, best unseen.\" In Clear and Present Danger nothing is as clear as it may seem.The president, unsatisfied with the success of his \"war on drugs,\" decides that he wants some immediate success. But after John Clark's covert strike team is deployed to Colombia for Operation Showboat, the drug lords strike back taking several civilian casualties. The chief executive's polls plummet. He orders Ritter to terminate their unofficial plan and leave no traces. Jack Ryan, who has just been named CIA deputy director of intelligence is enraged when he discovers that has been left out of the loop of Colombian operations. Several of America's most highly trained soldiers are stranded in an unfinished mission that, according to all records, never existed. Ryan decides to get the men out.",
    "rating": null,
    "ratingsCount": null,
    "author": "Tom Clancy",
    "publishedDate": "1989",
    "publisher": "HarperCollins",
    "pageCount": 824,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0002234777",
    "isbn13": "9780002234771",
    "language": "en",
    "fetchedAt": 1770107733190
  },
  "dead man's walk|larry mcmurtry": {
    "description": "In Dead Man's Walk, the prequel to the bestselling books, Lonesome Dove and Streets of Laredo, McMurtry dazzles readers once more with the early adventures of two of the most memorable heroes in contemporary fiction--Augustus McCrae and Woodrow Call. National ads/media.",
    "rating": null,
    "ratingsCount": null,
    "author": "Larry McMurtry",
    "publishedDate": "1996",
    "publisher": "Macmillan Reference USA",
    "pageCount": 652,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0783815107",
    "isbn13": "9780783815107",
    "language": "en",
    "fetchedAt": 1770107733866
  },
  "death in the city of light|david king": {
    "description": "The gripping, true story of a brutal serial killer who unleashed his own reign of terror in Nazi-Occupied Paris. As decapitated heads and dismembered body parts surfaced in the Seine, Commissaire Georges-Victor Massu, head of the Brigade Criminelle, was tasked with tracking down the elusive murderer in a twilight world of Gestapo, gangsters, resistance fighters, pimps, prostitutes, spies, and other shadowy figures of the Parisian underworld. But while trying to solve the many mysteries of the case, Massu would unravel a plot of unspeakable deviousness. The main suspect, Dr. Marcel Petiot, was a handsome, charming physician with remarkable charisma. He was the “People’s Doctor,” known for his many acts of kindness and generosity, not least in providing free medical care for the poor. Petiot, however, would soon be charged with twenty-seven murders, though authorities suspected the total was considerably higher, perhaps even as many as 150. Petiot's trial quickly became a circus. Attempting to try all twenty-seven cases at once, the prosecution stumbled in its marathon cross-examinations, and Petiot, enjoying the spotlight, responded with astonishing ease. Soon, despite a team of prosecuting attorneys, dozens of witnesses, and over one ton of evidence, Petiot’s brilliance and wit threatened to win the day. Drawing extensively on many new sources, including the massive, classified French police file on Dr. Petiot, Death in the City of Light is a brilliant evocation of Nazi-Occupied Paris and a harrowing exploration of murder, betrayal, and evil of staggering proportions.",
    "rating": null,
    "ratingsCount": null,
    "author": "David King",
    "publishedDate": "2012-06-05",
    "publisher": "Crown",
    "pageCount": 442,
    "genres": [
      "True Crime"
    ],
    "series": null,
    "isbn10": "0307452905",
    "isbn13": "9780307452900",
    "language": "en",
    "fetchedAt": 1770107734636
  },
  "eiger dreams|jon krakauer": {
    "description": "No one writes about mountaineering and its attendant hardships and victories more brilliantly than critically acclaimed author Jon Krakauer. In this collection of his finest work from such magazines as Outside and Smithsonian, he explores the subject from the unique and memorable perspective of one who has battled peaks like K2, Denali, Everest, and, of course, the Eiger. Always with a keen eye, an open heart, and a hunger for the ultimate experience, he gives us unerring portraits of the mountaineering experience. Yet Eiger Dreams is more about people than about rock and ice—people with that odd, sometimes maniacal obsession with mountain summits that sets them apart from other men and women. Here we meet Adrian the Romanian, determined to be the first of his countrymen to solo Denali; John Gill, climber not of great mountains but of house-sized boulders so difficult to surmount that even demanding alpine climbs seem easy; and many more compelling and colorful characters. In the most intimate piece, “The Devils Thumb,” Krakauer recounts his own near-fatal, ultimately triumphant struggle with solo-madness as he scales Alaska’s Devils Thumb. Eiger Dreams is stirring, vivid writing about one of the most compelling and dangerous of all human pursuits.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jon Krakauer",
    "publishedDate": "2009-02-10",
    "publisher": "Simon and Schuster",
    "pageCount": 211,
    "genres": [
      "Sports & Recreation"
    ],
    "series": null,
    "isbn10": "1599217708",
    "isbn13": "9781599217703",
    "language": "en",
    "fetchedAt": 1770107735211
  },
  "everything matters!|ron currie jr.": {
    "description": "\"Startlingly talented . . . he survives the inevitable, apt comparisons to Kurt Vonnegut and writes in a tenderly mordant voice all his own.\" -Janet Maslin, The New York Times In this novel rich in character, Junior Thibodeau grows up in rural Maine in a time of Atari, baseball cards, pop Catholicism, and cocaine. He also knows something no one else knows-neither his exalted parents, nor his baseball-savant brother, nor the love of his life (she doesn't believe him anyway): The world will end when he is thirty-six. While Junior searches for meaning in a doomed world, his loved ones tell an all-American family saga of fathers and sons, blinding romance, lost love, and reconciliation-culminating in one final triumph that reconfigures the universe. A tour de force of storytelling, Everything Matters! is a genre-bending potpourri of alternative history, sci-fi, and the great American tale in the tradition of John Irving and Margaret Atwood.",
    "rating": 4,
    "ratingsCount": 1,
    "author": "Ron Currie",
    "publishedDate": "2009-06-25",
    "publisher": "Penguin",
    "pageCount": 271,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "1101050926",
    "isbn13": "9781101050927",
    "language": "en",
    "fetchedAt": 1770107735860
  },
  "hell's angels|hunter s. thompson": {
    "description": "Gonzo journalist and literary roustabout Hunter S. Thompson flies with the angels—Hell’s Angels, that is—in this short work of nonfiction. “California, Labor Day weekend . . . early, with ocean fog still in the streets, outlaw motorcyclists wearing chains, shades and greasy Levis roll out from damp garages, all-night diners and cast-off one-night pads in Frisco, Hollywood, Berdoo and East Oakland, heading for the Monterey peninsula, north of Big Sur. . . The Menace is loose again.” Thus begins Hunter S. Thompson’s vivid account of his experiences with California’s most notorious motorcycle gang, the Hell’s Angels. In the mid-1960s, Thompson spent almost two years living with the controversial Angels, cycling up and down the coast, reveling in the anarchic spirit of their clan, and, as befits their name, raising hell. His book successfully captures a singular moment in American history, when the biker lifestyle was first defined, and when such countercultural movements were electrifying and horrifying America. Thompson, the creator of Gonzo journalism, writes with his usual bravado, energy, and brutal honesty, and with a nuanced and incisive eye; as The New Yorker pointed out, “For all its uninhibited and sardonic humor, Thompson’s book is a thoughtful piece of work.” As illuminating now as when originally published in 1967, Hell’s Angels is a gripping portrait, and the best account we have of the truth behind an American legend.",
    "rating": 4,
    "ratingsCount": 3,
    "author": "Hunter S. Thompson",
    "publishedDate": "1999-12-07",
    "publisher": "Modern Library",
    "pageCount": 290,
    "genres": [
      "Biography & Autobiography"
    ],
    "series": null,
    "isbn10": "067960331X",
    "isbn13": "9780679603313",
    "language": "en",
    "fetchedAt": 1770107736587
  },
  "home is where the bodies are|jeneva rose": {
    "description": "A New York Times and USA Today bestseller From #1 New York Times bestselling author of The Perfect Marriage and You Shouldn’t Have Come Here comes a chilling family thriller about the (sometimes literal) skeletons in the closet. After their mother passes, three estranged siblings reunite to sort out her estate. Beth, the oldest, never left home. She stayed with her mom, caring for her until the very end. Nicole, the middle child, has been kept at arm’s length due to her ongoing battle with a serious drug addiction. Michael, the youngest, lives out of state and hasn’t been back to their small Wisconsin town since their father ran out on them seven years before. While going through their parents’ belongings, the siblings stumble upon a collection of home videos and decide to revisit those happier memories. However, the nostalgia is cut short when one of the VHS tapes reveals a night back in 1999 that none of them have any recollection of. On screen, their father appears covered in blood. What follows is a dead body and a pact between their parents to get rid of it, before the video abruptly ends. Beth, Nicole, and Michael must now decide whether to leave the past in the past or uncover the dark secret their mother took to her grave.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jeneva Rose",
    "publishedDate": "2024-04-30",
    "publisher": "Blackstone Publishing",
    "pageCount": 279,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": null,
    "isbn13": "9798212182867",
    "language": "en",
    "fetchedAt": 1770107737248
  },
  "homicide|david simon": {
    "description": "\"Remarkable . . . a true crime classic . . . a journalistic masterpiece. . . . (A) saga of a brutal, bloody, bewildering year in the Baltimore Police Department's homicide unit. . . . This is interior reporting at its finest\".--\"Associated Press\". An Edgar Award winner and the basis for the popular television series of the same title. Copyright © Libri GmbH. All rights reserved.",
    "rating": 5,
    "ratingsCount": 1,
    "author": "David Simon",
    "publishedDate": "1991",
    "publisher": null,
    "pageCount": 616,
    "genres": [
      "History"
    ],
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "en",
    "fetchedAt": 1770107737869
  },
  "in cold blood|truman capote": {
    "description": "NATIONAL BESTSELLER • The most famous true crime novel of all time \"chills the blood and exercises the intelligence\" (The New York Review of Books)—and haunted its author long after he finished writing it. On November 15, 1959, in the small town of Holcomb, Kansas, four members of the Clutter family were savagely murdered by blasts from a shotgun held a few inches from their faces. There was no apparent motive for the crime, and there were almost no clues. In one of the first non-fiction novels ever written, Truman Capote reconstructs the murder and the investigation that led to the capture, trial, and execution of the killers, generating both mesmerizing suspense and astonishing empathy. In Cold Blood is a work that transcends its moment, yielding poignant insights into the nature of American violence.",
    "rating": 4,
    "ratingsCount": 6,
    "author": "Truman Capote",
    "publishedDate": "2001-10-09",
    "publisher": "Vintage",
    "pageCount": 345,
    "genres": [
      "True Crime"
    ],
    "series": null,
    "isbn10": "1588361659",
    "isbn13": "9781588361653",
    "language": "en",
    "fetchedAt": 1770107738590
  },
  "in dubious battle|john steinbeck": {
    "description": "A riveting novel of labor strife and apocalyptic violence, now a major motion picture starring James Franco, Bryan Cranston, Selena Gomez, and Zach Braff A Penguin Classic At once a relentlessly fast-paced, admirably observed novel of social unrest and the story of a young man's struggle for identity, In Dubious Battle is set in the California apple country, where a strike by migrant workers against rapacious landowners spirals out of control, as a principled defiance metamorphoses into blind fanaticism. Caught in the upheaval is Jim Nolan, a once aimless man who find himself in the course of the strike, briefly becomes its leader, and is ultimately crushed in its service. For more than seventy years, Penguin has been the leading publisher of classic literature in the English-speaking world. With more than 1,700 titles, Penguin Classics represents a global bookshelf of the best works throughout history and across genres and disciplines. Readers trust the series to provide authoritative texts enhanced by introductions and notes by distinguished scholars and contemporary authors, as well as up-to-date translations by award-winning translators.",
    "rating": null,
    "ratingsCount": null,
    "author": "John Steinbeck",
    "publishedDate": "2006-05-30",
    "publisher": "Penguin",
    "pageCount": 308,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0143039636",
    "isbn13": "9780143039631",
    "language": "en",
    "fetchedAt": 1770107739191
  },
  "jpod|douglas coupland": {
    "description": "A lethal joyride into today’s new breed of technogeeks, Coupland’s JPod updates Microserfs for the age of Google. Ethan Jarlewski and five co-workers whose names start with J are bureaucratically marooned in jPod, a no-escape architectural limbo on the fringes of a massive Vancouver game design company. The six workers daily confront the forces that define our era: global piracy, boneheaded marketing staff, people smuggling, the rise of China, marijuana grow-ops, Jeff Probst and the ashes of the 1990s financial tech dream. jPod’s universe is amoral and shameless. The characters are products of their era even as they’re creating it. Everybody in Ethan’s life inhabits a moral grey zone. Nobody is exempt, not even his seemingly straitlaced parents or Coupland himself, as readers will see. Full of word games, visual jokes and sideways jabs, this book throws a sharp, pointed lawn dart into the heart of contemporary life. JPod is Douglas Coupland at the top of his game.",
    "rating": null,
    "ratingsCount": null,
    "author": "Douglas Coupland",
    "publishedDate": "2011-03-18",
    "publisher": "Vintage Canada",
    "pageCount": 530,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0307371395",
    "isbn13": "9780307371393",
    "language": "en",
    "fetchedAt": 1770107739857
  },
  "leviathan wakes|james s. a. corey": {
    "description": "From a New York Times bestselling and Hugo award-winning author comes a modern masterwork of science fiction, introducing a captain, his crew, and a detective as they unravel a horrifying solar system wide conspiracy that begins with a single missing girl. Now a Prime Original series. Humanity has colonized the solar system—Mars, the Moon, the Asteroid Belt and beyond—but the stars are still out of our reach. Jim Holden is XO of an ice miner making runs from the rings of Saturn to the mining stations of the Belt. When he and his crew stumble upon a derelict ship, the Scopuli, they find themselves in possession of a secret they never wanted. A secret that someone is willing to kill for—and kill on a scale unfathomable to Jim and his crew. War is brewing in the system unless he can find out who left the ship and why. Detective Miller is looking for a girl. One girl in a system of billions, but her parents have money and money talks. When the trail leads him to the Scopuli and rebel sympathizer Holden, he realizes that this girl may be the key to everything. Holden and Miller must thread the needle between the Earth government, the Outer Planet revolutionaries, and secretive corporations—and the odds are against them. But out in the Belt, the rules are different, and one small ship can change the fate of the universe.​ \"Interplanetary adventure the way it ought to be written.\" —George R. R. Martin Hugo Award Winner for Best Series The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​ Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers​",
    "rating": 4,
    "ratingsCount": 56,
    "author": "James S. A. Corey",
    "publishedDate": "2011-06-15",
    "publisher": "Orbit",
    "pageCount": 411,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316134678",
    "isbn13": "9780316134675",
    "language": "en",
    "fetchedAt": 1770107740525
  },
  "lonesome dove|larry mcmurtry": {
    "description": "Two former Texas Rangers, Augustus McCrae and Woodrow Call, leave their Texas ranch to lead a cattle drive to Montana, encountering outlaws, Native Americans, and ex-loves along the way.",
    "rating": 4,
    "ratingsCount": 1,
    "author": "Larry McMurtry",
    "publishedDate": "1986",
    "publisher": "Simon and Schuster",
    "pageCount": 864,
    "genres": [
      "Cattle drives"
    ],
    "series": null,
    "isbn10": "1439195269",
    "isbn13": "9781439195260",
    "language": "en",
    "fetchedAt": 1770107741255
  },
  "nemesis games|james s. a. corey": {
    "description": "With over 10 million copies sold, The Expanse has become one of the biggest science fiction phenomenons of the decade. The fifth book in the New York Times bestselling Expanse series, Nemesis Games drives the crew of the Rocinante apart, and as they struggle to survive, the inner planets fall victim to an enemy's catastrophic plan. Now a Prime Original series. A thousand worlds have opened, and the greatest land rush in human history has begun. As wave after wave of colonists leave, the power structures of the old solar system begin to buckle. Ships are disappearing without a trace. Private armies are being secretly formed. The sole remaining protomolecule sample is stolen. Terrorist attacks previously considered impossible bring the inner planets to their knees. The sins of the past are returning to exact a terrible price. And as a new human order is struggling to be born in blood and fire, James Holden and the crew of the Rocinante must struggle to survive and get back to the only home they have left. Nemesis Games is a breakneck science fiction adventure following the bestselling Cibola Burn. \"Interplanetary adventure the way it ought to be written.\" —George R. R. Martin Hugo Award Winner for Best Series The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers",
    "rating": 5,
    "ratingsCount": 1,
    "author": "James S. A. Corey",
    "publishedDate": "2015-06-02",
    "publisher": "Orbit",
    "pageCount": 326,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "031621759X",
    "isbn13": "9780316217590",
    "language": "en",
    "fetchedAt": 1770107741862
  },
  "no country for old men|cormac mccarthy": {
    "description": "Stumbling upon a bloody massacre, a cache of heroin, and more than two million in cash during a hunting trip, Llewelyn Moss removes the money, a decision that draws him and his young wife into the middle of a violent confrontation.",
    "rating": null,
    "ratingsCount": null,
    "author": "Cormac McCarthy",
    "publishedDate": "2006",
    "publisher": "Random House Digital, Inc.",
    "pageCount": 322,
    "genres": [
      "Drug traffic"
    ],
    "series": null,
    "isbn10": "0307277038",
    "isbn13": "9780307277039",
    "language": "en",
    "fetchedAt": 1770107742527
  },
  "outer dark|cormac mccarthy": {
    "description": "From the bestselling author of The Passenger and the Pulitzer Prize–winning novel The Road • A novel at once fabular and starkly evocative, set is an unspecified place in Appalachia, sometime around the turn of the century. A woman bears her brother's child, a boy; he leaves the baby in the woods and tells her he died of natural causes. Discovering her brother's lie, she sets forth alone to find her son. Both brother and sister wander separately through a countryside being scourged by three terrifying and elusive strangers, headlong toward an eerie, apocalyptic resolution.",
    "rating": null,
    "ratingsCount": null,
    "author": "Cormac McCarthy",
    "publishedDate": "1993-06-29",
    "publisher": "Vintage",
    "pageCount": 257,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0679728732",
    "isbn13": "9780679728733",
    "language": "en",
    "fetchedAt": 1770107743189
  },
  "project hail mary|andy weir": {
    "description": "THE #1 NEW YORK TIMES BESTSELLER FROM THE AUTHOR OF THE MARTIAN • Soon to be a major motion picture starring Ryan Gosling, directed by Phil Lord and Christopher Miller, with a screenplay by Drew Goddard A lone astronaut must save the earth from disaster in this “propulsive” (Entertainment Weekly), cinematic thriller full of suspense, humor, and fascinating science. HUGO AWARD FINALIST • ONE OF THE YEAR’S BEST BOOKS: Bill Gates, GatesNotes, New York Public Library, Parade, Newsweek, Polygon, Shelf Awareness, She Reads, Kirkus Reviews, Library Journal • New York Times Readers Pick: 100 Best Books of the 21st Century “An epic story of redemption, discovery and cool speculative sci-fi.”—USA Today “If you loved The Martian, you’ll go crazy for Weir’s latest.”—The Washington Post Ryland Grace is the sole survivor on a desperate, last-chance mission—and if he fails, humanity and the earth itself will perish. Except that right now, he doesn’t know that. He can’t even remember his own name, let alone the nature of his assignment or how to complete it. All he knows is that he’s been asleep for a very, very long time. And he’s just been awakened to find himself millions of miles from home, with nothing but two corpses for company. His crewmates dead, his memories fuzzily returning, Ryland realizes that an impossible task now confronts him. Hurtling through space on this tiny ship, it’s up to him to puzzle out an impossible scientific mystery—and conquer an extinction-level threat to our species. And with the clock ticking down and the nearest human being light-years away, he’s got to do it all alone. Or does he? An irresistible interstellar adventure as only Andy Weir could deliver, Project Hail Mary is a tale of discovery, speculation, and survival to rival The Martian—while taking us to places it never dreamed of going.",
    "rating": null,
    "ratingsCount": null,
    "author": "Andy Weir",
    "publishedDate": "2025-12-02",
    "publisher": "Random House",
    "pageCount": 497,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": null,
    "isbn13": "9798217299461",
    "language": "en",
    "fetchedAt": 1770107743868
  },
  "stiff|mary roach": {
    "description": "A New York Times forensic science bestseller, \"this quirky, funny read offers perspective and insight about life, death and the medical profession.\"* For two thousand years, cadavers—some willingly, some unwittingly—have been involved in science's boldest strides and weirdest undertakings. They've tested France's first guillotines, ridden the NASA Space Shuttle, been crucified in a Parisian laboratory to test the authenticity of the Shroud of Turin, and helped solve the mystery of TWA Flight 800. For every new surgical procedure, from heart transplants to gender confirmation surgery, cadavers have helped make history in their quiet way. \"Delightful—though never disrespectful\" ( Time Out New York), science writer Mary Roach's Stiff investigates the strange lives of our bodies postmortem and answers the question: What should we do after we die? \"You can close this book with an appreciation of the miracle that the human body really is.\" —* Wall Street Journal \"Acutely entertaining, morbidly fascinating.\" — Forbes \"One of the funniest and most unusual books of the year. . . . Gross, educational, and unexpectedly sidesplitting.\" — Entertainment Weekly With an Epilogue by the Author",
    "rating": 4,
    "ratingsCount": 52,
    "author": "Mary Roach",
    "publishedDate": "2004-05-17",
    "publisher": "W. W. Norton & Company",
    "pageCount": 305,
    "genres": [
      "Science"
    ],
    "series": null,
    "isbn10": "0393069192",
    "isbn13": "9780393069198",
    "language": "en",
    "fetchedAt": 1770107744524
  },
  "streets of laredo|larry mcmurtry": {
    "description": "The acclaimed sequel to Larry McMurtry’s Pulitzer Prize–winning classic Lonesome Dove, and the culmination of the legendary western saga, follows the further adventures of these beloved characters as they reckon with their past choices and uncertain futures in the rapidly changing American West. Captain Woodrow Call, August McCrae's old partner, is now a bounty hunter hired to track down a brutal young Mexican bandit. Riding with Call are an Eastern city slicker, a witless deputy, and one of the last members of the Hat Creek outfit, Pea Eye Parker, now married to Lorena—once Gus McCrae's sweetheart. This long chase leads them across the last wild stretches of the West into a hellhole known as Crow Town and, finally, into the vast, relentless plains of the Texas frontier.",
    "rating": null,
    "ratingsCount": null,
    "author": "Larry McMurtry",
    "publishedDate": "2010-06-01",
    "publisher": "Simon and Schuster",
    "pageCount": 565,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "1439126372",
    "isbn13": "9781439126370",
    "language": "en",
    "fetchedAt": 1770107745188
  },
  "sweet thursday|john steinbeck": {
    "description": "In Monterey, on the California Coast, Sweet Thursday is what they call the day after Lousy Wednesday, which is one of those days that's just naturally bad. Returning to the scene of CANNERY ROW, the weedy lots, junk heaps and flop houses of Monterey, Steinbeck once again brings to life the denizens of a netherworld of laughter and tears. The book is in many ways a statement about Steinbeck's greatest theme: the common bonds of humanity and love which make goodness and happiness possible.",
    "rating": null,
    "ratingsCount": null,
    "author": "John Steinbeck",
    "publishedDate": "2000-11-30",
    "publisher": "Penguin UK",
    "pageCount": 254,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "014118552X",
    "isbn13": "9780141185521",
    "language": "en",
    "fetchedAt": 1770107745857
  },
  "tender is the flesh|agustina bazterrica": {
    "description": "INTERNATIONAL BESTSELLER Working at the local processing plant, Marcos is in the business of slaughtering humans—though no one calls them that anymore. His wife has left him, his father is sinking into dementia, and Marcos tries not to think too hard about how he makes a living. After all, it happened so quickly. First, it was reported that an infectious virus has made all animal meat poisonous to humans. Then governments initiated the “Transition.” Now, eating human meat—“special meat”—is legal. Marcos tries to stick to numbers, consignments, processing. Then one day he’s given a gift: a live specimen of the finest quality. Though he’s aware that any form of personal contact is forbidden on pain of death, little by little he starts to treat her like a human being. And soon, he becomes tortured by what has been lost—and what might still be saved.",
    "rating": null,
    "ratingsCount": null,
    "author": "Agustina Bazterrica",
    "publishedDate": "2020-08-04",
    "publisher": "Scribner",
    "pageCount": 240,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "1982150920",
    "isbn13": "9781982150921",
    "language": "en",
    "fetchedAt": 1770107746528
  },
  "the bogleheads' guide to investing|mel lindauer, taylor larimore, michael leboeuf, and john c. bogle": {
    "description": "The irreverent guide to investing, Boglehead style The Boglehead's Guide to Investing is a DIY handbook that espouses the sage investment wisdom of John C. Bogle. This witty and wonderful book offers contrarian advice that provides the first step on the road to investment success, illustrating how relying on typical \"common sense\" promoted by Wall Street is destined to leave you poorer. This updated edition includes new information on backdoor Roth IRAs and ETFs as mainstream buy and hold investments, estate taxes and gifting, plus changes to the laws regarding Traditional and Roth IRAs, and 401k and 403b retirement plans. With warnings and principles both precisely accurate and grandly counterintuitive, the Boglehead authors show how beating the market is a zero-sum game. Investing can be simple, but it's certainly not simplistic. Over the course of twenty years, the followers of John C. Bogle have evolved from a loose association of investors to a major force with the largest and most active non-commercial financial forum on the Internet. The Boglehead's Guide to Investing brings that communication to you with comprehensive guidance to the investment prowess on display at Bogleheads.org. You'll learn how to craft your own investment strategy using the Bogle-proven methods that have worked for thousands of investors, and how to: Choose a sound financial lifestyle and diversify your portfolio Start early, invest regularly, and know what you're buying Preserve your buying power, keeping costs and taxes low Throw out the \"good\" advice promoted by Wall Street that leads to investment failure Financial markets are essentially closed systems in which one's gain garners another's loss. Investors looking for a roadmap to successfully navigating these choppy waters long-term will find expert guidance, sound advice, and a little irreverent humor in The Boglehead's Guide to Investing.",
    "rating": null,
    "ratingsCount": null,
    "author": "Mel Lindauer",
    "publishedDate": "2021-11-23",
    "publisher": "John Wiley & Sons",
    "pageCount": 343,
    "genres": [
      "Business & Economics"
    ],
    "series": null,
    "isbn10": "1119847672",
    "isbn13": "9781119847670",
    "language": "en",
    "fetchedAt": 1770107747238
  },
  "the deep sky|yume kitasei": {
    "description": "Yume Kitasei's The Deep Sky is an enthralling sci fi thriller debut about a mission into deep space that begins with a lethal explosion that leaves the survivors questioning the loyalty of the crew. They left Earth to save humanity. They’ll have to save themselves first. It is the eve of Earth’s environmental collapse. A single ship carries humanity’s last hope: eighty elite graduates of a competitive program, who will give birth to a generation of children in deep space. But halfway to a distant but livable planet, a lethal bomb kills three of the crew and knocks The Phoenix off course. Asuka, the only surviving witness, is an immediate suspect. As the mystery unfolds on the ship, poignant flashbacks reveal how Asuka came to be picked for the mission. Despite struggling through training back on Earth, she was chosen to represent Japan, a country she only partly knows as a half-Japanese girl raised in America. But estranged from her mother back home, The Phoenix is all she has left. With the crew turning on each other, Asuka is determined to find the culprit before they all lose faith in the mission—or worse, the bomber strikes again.",
    "rating": null,
    "ratingsCount": null,
    "author": "Yume Kitasei",
    "publishedDate": "2023-07-18",
    "publisher": "Flatiron Books",
    "pageCount": 341,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "125087534X",
    "isbn13": "9781250875341",
    "language": "en",
    "fetchedAt": 1770107747862
  },
  "the descent|jeff long": {
    "description": "We are not alone. Some call them devils or demons. But they are real. They are down there. And they are waiting for us to find them. In a cave in the Himalayas, a guide discovers a self-mutilated body with a warning: Satan exists. In the Kalahari Desert, a nun unearths evidence of a proto-human species and a deity called Older-than-Old. In Bosnia, something has been feeding upon the dead in a mass grave. So begins mankind’s most shocking realization: the underworld is a vast geological labyrinth populated by another race of beings. With all of Hell's precious resources and territories to be won, a global race ensues. Nations, armies, religions, and industries rush to colonize and exploit the subterranean frontier. A scientific expedition is launched westward to explore beneath the Pacific Ocean floor, both to catalog the riches there and to learn how life could develop in the sunless abyss. But in the dark underground, as humanity falls away from them, the scientists and mercenaries find themselves prey not only to the savage creatures, but also to their own treachery, mutiny, and greed. One thing is certain: Miles inside the earth, evil is very much alive.",
    "rating": 5,
    "ratingsCount": 3,
    "author": "Jeff Long",
    "publishedDate": "1999-11-12",
    "publisher": "Crown",
    "pageCount": 639,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0609607022",
    "isbn13": "9780609607022",
    "language": "en",
    "fetchedAt": 1770107748524
  },
  "the devotion of suspect x|keigo higashino": {
    "description": "Now a major motion picture on Netflix, Jaane Jaan This e-book now includes preview chapters from Higashino's newest mystery, SALVATION OF A SAINT. Yasuko Hanaoka is a divorced, single mother who thought she had finally escaped her abusive ex-husband Togashi. When he shows up one day to extort money from her, threatening both her and her teenaged daughter Misato, the situation quickly escalates into violence and Togashi ends up dead on her apartment floor. Overhearing the commotion, Yasuko's next door neighbor, middle-aged high school mathematics teacher Ishigami, offers his help, disposing not only of the body but plotting the cover-up step-by-step. When the body turns up and is identified, Detective Kusanagi draws the case and Yasuko comes under suspicion. Kusanagi is unable to find any obvious holes in Yasuko's manufactured alibi and yet is still sure that there's something wrong. Kusanagi brings in Dr. Manabu Yukawa, a physicist and college friend who frequently consults with the police. Yukawa, known to the police by the nickname Professor Galileo, went to college with Ishigami. After meeting up with him again, Yukawa is convinced that Ishigami had something to do with the murder. What ensues is a high level battle of wits, as Ishigami tries to protect Yasuko by outmaneuvering and outthinking Yukawa, who faces his most clever and determined opponent yet.",
    "rating": 3,
    "ratingsCount": 4,
    "author": "Keigo Higashino",
    "publishedDate": "2011-02-01",
    "publisher": "Minotaur Books",
    "pageCount": 305,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "142999231X",
    "isbn13": "9781429992312",
    "language": "en",
    "fetchedAt": 1770107749190
  },
  "the gone world|tom sweterlitsch": {
    "description": "Inception meets True Detective in this science fiction thriller of spellbinding tension and staggering scope that follows a special agent into a savage murder case with grave implications for the fate of mankind... “I promise you have never read a story like this.”—Blake Crouch, New York Times bestselling author of Dark Matter Shannon Moss is part of a clandestine division within the Naval Criminal Investigative Service. In western Pennsylvania, 1997, she is assigned to solve the murder of a Navy SEAL's family—and to locate his vanished teenage daughter. Though she can't share the information with conventional law enforcement, Moss discovers that the missing SEAL was an astronaut aboard the spaceship U.S.S. Libra—a ship assumed lost to the currents of Deep Time. Moss knows first-hand the mental trauma of time-travel and believes the SEAL's experience with the future has triggered this violence. Determined to find the missing girl and driven by a troubling connection from her own past, Moss travels ahead in time to explore possible versions of the future, seeking evidence to crack the present-day case. To her horror, the future reveals that it's not only the fate of a family that hinges on her work, for what she witnesses rising over time's horizon and hurtling toward the present is the Terminus: the terrifying and cataclysmic end of humanity itself. Luminous and unsettling, The Gone World bristles with world-shattering ideas yet remains at its heart an intensely human story.",
    "rating": 5,
    "ratingsCount": 1,
    "author": "Tom Sweterlitsch",
    "publishedDate": "2018-02-06",
    "publisher": "Penguin",
    "pageCount": 402,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0698142764",
    "isbn13": "9780698142763",
    "language": "en",
    "fetchedAt": 1770107749858
  },
  "the handmaid's tale|margaret atwood": {
    "description": "An instant classic and eerily prescient cultural phenomenon, from “the patron saint of feminist dystopian fiction” (New York Times). Now an award-winning Hulu series starring Elizabeth Moss. In this multi-award-winning, bestselling novel, Margaret Atwood has created a stunning Orwellian vision of the near future. This is the story of Offred, one of the unfortunate “Handmaids” under the new social order who have only one purpose: to breed. In Gilead, where women are prohibited from holding jobs, reading, and forming friendships, Offred’s persistent memories of life in the “time before” and her will to survive are acts of rebellion. Provocative, startling, prophetic, and with Margaret Atwood’s devastating irony, wit, and acute perceptive powers in full force, The Handmaid’s Tale is at once a mordant satire and a dire warning.",
    "rating": null,
    "ratingsCount": null,
    "author": "Margaret Atwood",
    "publishedDate": "2011-09-06",
    "publisher": "McClelland & Stewart",
    "pageCount": 385,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0771008791",
    "isbn13": "9780771008795",
    "language": "en",
    "fetchedAt": 1770107750524
  },
  "the hunt for red october|tom clancy": {
    "description": "Don't Miss the Original Series Tom Clancy's Jack Ryan Starring John Krasinski! The #1 New York Times bestseller that launched the phenomenal career of Tom Clancy—a gripping military thriller that introduced the world to his unforgettable hero, Jack Ryan—nominated as one of America’s best-loved novels by PBS’s The Great American Read. Somewhere under the freezing Atlantic, a Soviet sub commander has just made a fateful decision. The Red October is heading west. The Americans want her. The Russians want her back. The chase for the highly advanced nuclear submarine is on—and there’s only one man who can find her... Brilliant CIA analyst Jack Ryan has little interest in fieldwork, but when covert photographs of Red October land on his desk, Ryan soon finds himself in the middle of a high-stakes game of hide-and-seek played by two world powers—a game that could end in all-out war.",
    "rating": 5,
    "ratingsCount": 1,
    "author": "Tom Clancy",
    "publishedDate": "2013-11-05",
    "publisher": "Penguin",
    "pageCount": 529,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0425269361",
    "isbn13": "9780425269367",
    "language": "en",
    "fetchedAt": 1770107751190
  },
  "the kind worth killing|peter swanson": {
    "description": "A devious tale of psychological suspense so irresistible that it prompts Entertainment Weekly to ask, “Is The Kind Worth Killing the next Gone Girl?” From one of the hottest new thriller writers, Peter Swanson, a name you may not know yet (but soon will), this is his breakout novel in the bestselling tradition of Paula Hawkins’ The Girl on the Train—and is soon to be a major movie directed by Agnieszka Holland. In a tantalizing set-up reminiscent of Patricia Highsmith’s classic Strangers on a Train… On a night flight from London to Boston, Ted Severson meets the stunning and mysterious Lily Kintner. Sharing one too many martinis, the strangers begin to play a game of truth, revealing very intimate details about themselves. Ted talks about his marriage that’s going stale and his wife Miranda, who he’s sure is cheating on him. Ted and his wife were a mismatch from the start—he the rich businessman, she the artistic free spirit—a contrast that once inflamed their passion, but has now become a cliché. But their game turns a little darker when Ted jokes that he could kill Miranda for what she’s done. Lily, without missing a beat, says calmly, “I’d like to help.” After all, some people are the kind worth killing, like a lying, stinking, cheating spouse. . . . Back in Boston, Ted and Lily’s twisted bond grows stronger as they begin to plot Miranda's demise. But there are a few things about Lily’s past that she hasn’t shared with Ted, namely her experience in the art and craft of murder, a journey that began in her very precocious youth. Suddenly these co-conspirators are embroiled in a chilling game of cat-and-mouse, one they both cannot survive . . . with a shrewd and very determined detective on their tail.",
    "rating": 5,
    "ratingsCount": 1,
    "author": "Peter Swanson",
    "publishedDate": "2016-03-29",
    "publisher": "William Morrow",
    "pageCount": null,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "006245031X",
    "isbn13": "9780062450319",
    "language": "en",
    "fetchedAt": 1770107751894
  },
  "the little book that still beats the market|joel greenblatt": {
    "description": "In 2005, Joel Greenblatt published a book that is already considered one of the classics of finance literature. In The Little Book that Beats the Market—a New York Times bestseller with 300,000 copies in print—Greenblatt explained how investors can outperform the popular market averages by simply and systematically applying a formula that seeks out good businesses when they are available at bargain prices. Now, with a new Introduction and Afterword for 2010, The Little Book that Still Beats the Market updates and expands upon the research findings from the original book. Included are data and analysis covering the recent financial crisis and model performance through the end of 2009. In a straightforward and accessible style, the book explores the basic principles of successful stock market investing and then reveals the author’s time-tested formula that makes buying above average companies at below average prices automatic. Though the formula has been extensively tested and is a breakthrough in the academic and professional world, Greenblatt explains it using 6th grade math, plain language and humor. He shows how to use his method to beat both the market and professional managers by a wide margin. You’ll also learn why success eludes almost all individual and professional investors, and why the formula will continue to work even after everyone “knows” it. While the formula may be simple, understanding why the formula works is the true key to success for investors. The book will take readers on a step-by-step journey so that they can learn the principles of value investing in a way that will provide them with a long term strategy that they can understand and stick with through both good and bad periods for the stock market. As the Wall Street Journal stated about the original edition, “Mr. Greenblatt...says his goal was to provide advice that, while sophisticated, could be understood and followed by his five children, ages 6 to 15. They are in luck. His ‘Little Book’ is one of the best, clearest guides to value investing out there.”",
    "rating": null,
    "ratingsCount": null,
    "author": "Joel Greenblatt",
    "publishedDate": "2010-09-07",
    "publisher": "John Wiley & Sons",
    "pageCount": 218,
    "genres": [
      "Business & Economics"
    ],
    "series": null,
    "isbn10": "0470624159",
    "isbn13": "9780470624159",
    "language": "en",
    "fetchedAt": 1770107752533
  },
  "the long way to a small, angry planet|becky chambers": {
    "description": "When Rosemary Harper joins the crew of the Wayfarer, she isn't expecting much. The Wayfarer, a patched-up ship that's seen better days, offers her everything she could possibly want: a small, quiet spot to call home for a while, adventure in far-off corners of the galaxy, and distance from her troubled past.\r\nBut Rosemary gets more than she bargained for with the Wayfarer. The crew is a mishmash of species and personalities, from Sissix, the friendly reptilian pilot, to Kizzy and Jenks, the constantly sparring engineers who keep the ship running. Life on board is chaotic, but more or less peaceful - exactly what Rosemary wants.\r\nUntil the crew are offered the job of a lifetime: the chance to build a hyperspace tunnel to a distant planet.",
    "rating": null,
    "ratingsCount": null,
    "author": "Becky Chambers",
    "publishedDate": "2015-08-11",
    "publisher": null,
    "pageCount": 416,
    "genres": null,
    "series": null,
    "isbn10": "1473619807",
    "isbn13": "9781473619807",
    "language": "en",
    "fetchedAt": 1770107753191
  },
  "the maltese falcon|dashiell hammett": {
    "description": "ONE OF TIME MAGAZINE'S 100 BEST MYSTERY AND THRILLER BOOKS OF ALL TIME • A special edition of this coolly glittering gem of detective fiction that has haunted three generations of readers, from one of the greatest mystery writers of all time. Featuring an introduction by James Ellroy. A treasure worth killing for. Sam Spade, a slightly shopworn private eye with his own solitary code of ethics. A perfumed grafter named Joel Cairo, a fat man name Gutman, and Brigid O’Shaughnessy, a beautiful and treacherous woman whose loyalties shift at the drop of a dime. These are the ingredients of Dashiell Hammett's iconic, influential, and beloved The Maltese Falcon. A Vintage Crime/Black Lizard Special Edition",
    "rating": null,
    "ratingsCount": null,
    "author": "Dashiell Hammett",
    "publishedDate": "2022-08-09",
    "publisher": "Vintage Crime/Black Lizard",
    "pageCount": 241,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0593311906",
    "isbn13": "9780593311905",
    "language": "en",
    "fetchedAt": 1770107753873
  },
  "the psychopath test|jon ronson": {
    "description": "They say one out of every hundred people is a psychopath. You probably passed one on the street today. These are people who have no empathy, who are manipulative, deceitful, charming, seductive, and delusional. This book is an exploration of their world and the madness industry. When Jon Ronson is drawn into an elaborate hoax played on some of the world's top scientists, his investigation leads him, unexpectedly, to psychopaths. He meets an influential psychologist who is convinced that many important business leaders and politicians are in fact high-flying, high-functioning psychopaths, and teaches Ronson how to spot them. Armed with these new abilities, Ronson meets a patient inside an asylum for the criminally insane who insists that he's sane, a mere run-of-the-mill troubled youth, not a psychopath -- a claim that might be only manipulation, and a sign of his psychopathy. He spends time with a death-squad leader institutionalized for mortgage fraud, and with a legendary CEO who took joy in shutting down factories and firing people. He delves into the history of psychopathy diagnosis and treatments, from LSD-fueled days-long naked therapy sessions in prisons to attempts to understand serial killers.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jon Ronson",
    "publishedDate": "2012-05",
    "publisher": "Riverhead Books",
    "pageCount": 290,
    "genres": [
      "Biography & Autobiography"
    ],
    "series": null,
    "isbn10": "1594485755",
    "isbn13": "9781594485756",
    "language": "en",
    "fetchedAt": 1770107754574
  },
  "the revenant|michael punke": {
    "description": "A thrilling tale of betrayal and revenge set against the nineteenth-century American frontier, the astonishing story of real-life trapper and frontiersman Hugh Glass.",
    "rating": null,
    "ratingsCount": null,
    "author": "Michael Punke",
    "publishedDate": "2015-01-06",
    "publisher": "Macmillan",
    "pageCount": 273,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "125006662X",
    "isbn13": "9781250066626",
    "language": "en",
    "fetchedAt": 1770107755193
  },
  "the road|cormac mccarthy": {
    "description": "In a novel set in an indefinite, futuristic, post-apocalyptic world, a father and his young son make their way through the ruins of a devastated American landscape, struggling to survive and preserve the last remnants of their own humanity",
    "rating": 3.5,
    "ratingsCount": 8,
    "author": "Cormac McCarthy",
    "publishedDate": "2007",
    "publisher": "Vintage Books",
    "pageCount": 297,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0307386457",
    "isbn13": "9780307386458",
    "language": "en",
    "fetchedAt": 1770107755860
  },
  "the silo series collection|hugh howey": {
    "description": "SEASON 2 OF THE ACCLAIMED SILO SERIES — BASED ON BOOK 1, WOOL — NOW ON APPLE TV+ For the first time ever, The Silo Saga Omnibus brings together all of the work in Hugh Howey's ground-breaking, best-selling, acclaimed series, including the individual novels Wool, Shift, and Dust, as well as original essays by the author, and a bonus chapbook of short fiction, Silo Stories The remnants of humanity live underground in a vast silo. In this subterranean world, rules matter. Rules keep people alive. And no rule is more strictly enforced than to never speak of going outside. The punishment is exile and death. When the sheriff of the silo commits the ultimate sin, the most unlikely of heroes takes his place. Juliette, a mechanic from the down deep, who never met a machine she couldn’t fix nor a rule she wouldn’t break. What happens when a world built on rules is handed over to someone who sees no need for them? And what happens when a world broken to its core comes up against someone who won’t stop until things are set to right? Their world is about to fall. What—and who—will rise?",
    "rating": null,
    "ratingsCount": null,
    "author": "Hugh Howey",
    "publishedDate": "2020-05-19",
    "publisher": "HarperCollins",
    "pageCount": 1929,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0358512913",
    "isbn13": "9780358512912",
    "language": "en",
    "fetchedAt": 1770107756385
  },
  "the splendid and the vile|erik larson": {
    "description": "#1 NEW YORK TIMES BESTSELLER • The author of The Devil in the White City and Dead Wake delivers an intimate chronicle of Winston Churchill and London during the Blitz—an inspiring portrait of courage and leadership in a time of unprecedented crisis “One of [Erik Larson’s] best books yet . . . perfectly timed for the moment.”—Time • “A bravura performance by one of America’s greatest storytellers.”—NPR NAMED ONE OF THE BEST BOOKS OF THE YEAR BY The New York Times Book Review • Time • Vogue • NPR • The Washington Post • Chicago Tribune • The Globe & Mail • Fortune • Bloomberg • New York Post • The New York Public Library • Kirkus Reviews • LibraryReads • PopMatters On Winston Churchill’s first day as prime minister, Adolf Hitler invaded Holland and Belgium. Poland and Czechoslovakia had already fallen, and the Dunkirk evacuation was just two weeks away. For the next twelve months, Hitler would wage a relentless bombing campaign, killing 45,000 Britons. It was up to Churchill to hold his country together and persuade President Franklin Roosevelt that Britain was a worthy ally—and willing to fight to the end. In The Splendid and the Vile, Erik Larson shows, in cinematic detail, how Churchill taught the British people “the art of being fearless.” It is a story of political brinkmanship, but it’s also an intimate domestic drama, set against the backdrop of Churchill’s prime-ministerial country home, Chequers; his wartime retreat, Ditchley, where he and his entourage go when the moon is brightest and the bombing threat is highest; and of course 10 Downing Street in London. Drawing on diaries, original archival documents, and once-secret intelligence reports—some released only recently—Larson provides a new lens on London’s darkest year through the day-to-day experience of Churchill and his family: his wife, Clementine; their youngest daughter, Mary, who chafes against her parents’ wartime protectiveness; their son, Randolph, and his beautiful, unhappy wife, Pamela; Pamela’s illicit lover, a dashing American emissary; and the advisers in Churchill’s “Secret Circle,” to whom he turns in the hardest moments. The Splendid and the Vile takes readers out of today’s political dysfunction and back to a time of true leadership, when, in the face of unrelenting horror, Churchill’s eloquence, courage, and perseverance bound a country, and a family, together.",
    "rating": null,
    "ratingsCount": null,
    "author": "Erik Larson",
    "publishedDate": "2022-02-15",
    "publisher": "Crown",
    "pageCount": 625,
    "genres": [
      "History"
    ],
    "series": null,
    "isbn10": "0385348738",
    "isbn13": "9780385348737",
    "language": "en",
    "fetchedAt": 1770107756857
  },
  "the third pole|mark synnott": {
    "description": "***NPR Books We Love selection*** “If you’re only going to read one Everest book this decade, make it The Third Pole. . . . A riveting adventure.”—Outside Shivering, exhausted, gasping for oxygen, beyond doubt . . . A hundred-year mystery lured veteran climber Mark Synnott into an unlikely expedition up Mount Everest during the spring 2019 season that came to be known as “the Year Everest Broke.” What he found was a gripping human story of impassioned characters from around the globe and a mountain that will consume your soul—and your life—if you let it. The mystery? On June 8, 1924, George Mallory and Sandy Irvine set out to stand on the roof of the world, where no one had stood before. They were last seen eight hundred feet shy of Everest’s summit still “going strong” for the top. Could they have succeeded decades before Sir Edmund Hillary and Tenzing Norgay? Irvine is believed to have carried a Kodak camera with him to record their attempt, but it, along with his body, had never been found. Did the frozen film in that camera have a photograph of Mallory and Irvine on the summit before they disappeared into the clouds, never to be seen again? Kodak says the film might still be viable. . . . Mark Synnott made his own ascent up the infamous North Face along with his friend Renan Ozturk, a filmmaker using drones higher than any had previously flown. Readers witness first-hand how Synnott’s quest led him from oxygen-deprivation training to archives and museums in England, to Kathmandu, the Tibetan high plateau, and up the North Face into a massive storm. The infamous traffic jams of climbers at the very summit immediately resulted in tragic deaths. Sherpas revolted. Chinese officials turned on Synnott’s team. An Indian woman miraculously crawled her way to frostbitten survival. Synnott himself went off the safety rope—one slip and no one would have been able to save him—committed to solving the mystery. Eleven climbers died on Everest that season, all of them mesmerized by an irresistible magic. The Third Pole is a rapidly accelerating ride to the limitless joy and horror of human obsession.",
    "rating": null,
    "ratingsCount": null,
    "author": "Mark Synnott",
    "publishedDate": "2021-04-13",
    "publisher": "Penguin",
    "pageCount": 465,
    "genres": [
      "Sports & Recreation"
    ],
    "series": null,
    "isbn10": "152474557X",
    "isbn13": "9781524745578",
    "language": "en",
    "fetchedAt": 1770107757865
  },
  "the ultimate hitchhiker's guide to the galaxy|douglas adams": {
    "description": "In one complete volume, here are the five classic novels from Douglas Adams’s beloved Hitchhiker series. Now celebrating the pivotal 42nd anniversary of The Hitchhiker’s Guide to the Galaxy, soon to be a Hulu original series! The Hitchhiker’s Guide to the Galaxy (Nominated as one of America’s best-loved novels by PBS’s The Great American Read) Seconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space. The Restaurant at the End of the Universe The moment before annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat. Life, the Universe and Everything The unhappy inhabitants of planet Krikkit are sick of looking at the night sky– so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew. So Long, and Thanks for All the Fish Back on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription thrusts him back to reality. So to speak. Mostly Harmless Just when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself? Includes the bonus story “Young Zaphod Plays It Safe” “With droll wit, a keen eye for detail and heavy doses of insight . . . Adams makes us laugh until we cry.”—San Diego Union-Tribune “Lively, sharply satirical, brilliantly written . . . ranks with the best set pieces in Mark Twain.”—The Atlantic",
    "rating": 4.5,
    "ratingsCount": 84,
    "author": "Douglas Adams",
    "publishedDate": "2002-04-30",
    "publisher": "Del Rey",
    "pageCount": 836,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0345453743",
    "isbn13": "9780345453747",
    "language": "en",
    "fetchedAt": 1770107759280
  },
  "the vital abyss|james s. a. corey": {
    "description": "A novella set in the hard-scrabble world of James S. A. Corey's NYT-bestselling Expanse series, The Vital Abyss is the secret history of the cataclysmic events that occurred on Eros station, and the revelation of what came after. . . Now a Prime Original series. This story will be available in the complete Expanse story collection, Memory’s Legion. HUGO AWARD WINNER FOR BEST SERIES Somewhere in the vast expanse of space, a group of prisoners lives in permanent captivity. The only company they have is each other and the Belters who guard them. The only stories they know are the triumphs and crimes that brought them there. The only future they see is an empty life in an enormous room. And then the man from Mars came along . . . The Expanse Leviathan Wakes Caliban's War Abaddon's Gate Cibola Burn Nemesis Games Babylon's Ashes Persepolis Rising Tiamat's Wrath ​Leviathan Falls Memory's Legion The Expanse Short Fiction Drive The Butcher of Anderson Station Gods of Risk The Churn The Vital Abyss Strange Dogs Auberon The Sins of Our Fathers",
    "rating": null,
    "ratingsCount": null,
    "author": "James S. A. Corey",
    "publishedDate": "2015-10-15",
    "publisher": "Orbit",
    "pageCount": 68,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316217565",
    "isbn13": "9780316217569",
    "language": "en",
    "fetchedAt": 1770107759713
  },
  "tokyo vice|jake adelstein": {
    "description": "NOW A MAX ORIGINAL SERIES. A riveting true-life tale of newspaper noir and Japanese organized crime from an American investigative journalist who \"pulls the curtain back on ... [an] element of Japanese society that few Westerners ever see\" (San Francisco Examiner). Jake Adelstein is the only American journalist ever to have been admitted to the insular Tokyo Metropolitan Police Press Club, where for twelve years he covered the dark side of Japan: extortion, murder, human trafficking, fiscal corruption, and of course, the yakuza. But when his final scoop exposed a scandal that reverberated all the way from the neon soaked streets of Tokyo to the polished Halls of the FBI and resulted in a death threat for him and his family, Adelstein decided to step down. Then, he fought back. In Tokyo Vice he delivers an unprecedented look at Japanese culture and searing memoir about his rise from cub reporter to seasoned journalist with a price on his head.",
    "rating": 3,
    "ratingsCount": 2,
    "author": "Jake Adelstein",
    "publishedDate": "2009-10-13",
    "publisher": "Vintage",
    "pageCount": 354,
    "genres": [
      "Biography & Autobiography"
    ],
    "series": null,
    "isbn10": "0307378942",
    "isbn13": "9780307378941",
    "language": "en",
    "fetchedAt": 1770107760633
  },
  "true grit|charles portis": {
    "description": "True Grit is Charles Portis' most famous novel--first published in 1968. It tells the story of Mattie Ross, who is just fourteen years of age when a coward going by the name of Tom Chaney shoots her father down in Fort Smith, Arkansas, and robs him of his life, his horse, and $150 in cash money. Mattie leaves home to avenge her father's blood. With the one-eyed Rooster Cogburn, the meanest available U.S. Marshal, by her side, Mattie pursues the homicide into Indian Territory.\r\n\r\nTrue Grit is eccentric, cool, straight, and unflinching, like Mattie herself. From a writer of true cult status, this is an American classic through and through.",
    "rating": null,
    "ratingsCount": null,
    "author": "CHALES PORTIS",
    "publishedDate": "1968",
    "publisher": null,
    "pageCount": 196,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "en",
    "fetchedAt": 1770107761202
  },
  "women and men police officers|gwendolyn l. gerber": {
    "description": "Challenging traditional beliefs about gender, Gerber develops a new model for understanding gender--the status model of gender stereotyping. She examines how expectations about status and gender impact police offers who work together as partners. Her study includes same-sex police partnerships as well as partnerships in which a woman works with a man. Interviews with police officers highlight the findings from Gerber's large-scale study of police partnerships. She explores what underlies gender stereotyping--why men appear to have more assertive or instrumental personality traits and women appear to have more accommodating or expressive traits. According to Gerber's status model, instrumental traits are associated with high status, and expressive traits are associated with low status; therefore, men and women only appear to have different personality traits because men have higher status than women. The book provides a provocative analysis for scholars and researchers in gender studies, criminal justice, psychology, and sociology, as well as for those involved in the supervision and training of police.",
    "rating": null,
    "ratingsCount": null,
    "author": "Gwendolyn L. Gerber",
    "publishedDate": "2001-05-30",
    "publisher": "Praeger",
    "pageCount": null,
    "genres": [
      "Psychology"
    ],
    "series": null,
    "isbn10": "0275967492",
    "isbn13": "9780275967499",
    "language": "en",
    "fetchedAt": 1770107761862
  },
  "you were never really here|jonathan ames": {
    "description": "Now a major motion picture starring Joaquin Phoenix, You Were Never Really Here is a gritty, harrowing story of corruption and one man's violent quest for vengeance. Joe has witnessed things that cannot be erased. A former FBI agent and Marine, his abusive childhood has left him damaged beyond repair. He has completely withdrawn from the world and earns his living rescuing girls who have been kidnapped into the sex trade. When he's hired to save the daughter of a corrupt New York senator held captive at a Manhattan brothel, he stumbles into a dangerous web of conspiracy, and he pays the price. As Joe's small web of associates are picked off one by one, he realizes that he has no choice but to take the fight to the men who want him dead. Brutal and redemptive in equal measure, You Were Never Really Here is a toxic shot of a thriller, laced with corruption, revenge and the darkest of inner demons.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jonathan Ames",
    "publishedDate": "2018-03-20",
    "publisher": "Vintage",
    "pageCount": 114,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0525562907",
    "isbn13": "9780525562900",
    "language": "en",
    "fetchedAt": 1770107762530
  },
  "full speed to a crash landing|arthur roth": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": "Arthur Roth",
    "publishedDate": "1983",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "en",
    "fetchedAt": 1770109132825
  },
  "the stardust grail|yume kitasei": {
    "description": "Save one world. Doom her own. Maya Hoshimoto was once the best art thief in the galaxy. For ten years, she returned stolen artifacts to alien civilizations—until a disastrous job forced her into hiding. Now she just wants to enjoy a quiet life as a graduate student of anthropology, but she’s haunted by persistent and disturbing visions of the future. Then an old friend comes to her with a job she can’t refuse: find a powerful object that could save an alien species from extinction. Except no one has seen it in living memory, and they aren’t the only ones hunting for it. Maya sets out on a breakneck quest through a universe teeming with strange life and ancient ruins. But the farther she goes, the more her visions cast a dark shadow over her team of friends new and old. Someone will betray her along the way. Worse yet, in choosing to save one species, she may condemn humanity and Earth itself.",
    "rating": null,
    "ratingsCount": null,
    "author": "Yume Kitasei",
    "publishedDate": "2024-06-11",
    "publisher": "Flatiron Books",
    "pageCount": 286,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "1250875382",
    "isbn13": "9781250875389",
    "language": "en",
    "fetchedAt": 1770107757267
  },
  "the ultimate guide to the world of options trading|options profits daily": {
    "description": "Effortless Trading: A Part-Time Trader's Guide to Profiting from Options and Futures Master Low-Effort, High-Reward Trading-Without Quitting Your Day Job Do you want to trade profitably while keeping your full-time job? Are you tired of complex trading strategies that demand hours of screen time? Effortless Trading is the ultimate guide for part-time traders looking to generate consistent income from options and futures-without making trading a second job. What Makes This Book Unique? Unlike traditional trading books that overwhelm you with unnecessary details, Effortless Trading strips away the complexity and focuses on what actually works. It's designed for busy professionals who want to build a stress-free, rules-based trading system that requires just minutes a day to execute. This book doesn't just teach trading-it shows you how to trade efficiently, minimize risk, and automate your strategy so you can make money without staring at charts all day. Who Is This Book For? ✅ Busy professionals-Doctors, engineers, consultants, and entrepreneurs who want to trade successfully while managing a career. ✅ New traders-If you're overwhelmed by the complexity of options and futures, this book simplifies everything with step-by-step guidance. ✅ Investors looking for extra income-Learn how to generate steady cash flow using options and futures without the stress of day trading. What You'll Learn Inside: ✔️ The Myth of Full-Time Trading-Why trading less often actually makes you more money. ✔️ The \"Few Minutes a Day\" Trading Plan-How to place high-probability trades in under 15 minutes a day. ✔️ The Best Strategies for Part-Time Traders-Cash-secured puts, covered calls, credit spreads, and the \"Overnight Futures Trade\" that lets you profit while you sleep. ✔️ How to Automate Your Trading-Trade smarter by using AI tools, alerts, and pre-set orders to manage trades effortlessly. ✔️ Risk Management for People Who Hate Losing Money-The \"1% Rule\" that protects your capital and ensures long-term profitability. Why This Book?",
    "rating": null,
    "ratingsCount": null,
    "author": "The Options Investor",
    "publishedDate": "2025-03-14",
    "publisher": "Independently Published",
    "pageCount": null,
    "genres": [
      "Business & Economics"
    ],
    "series": null,
    "isbn10": null,
    "isbn13": "9798314131411",
    "language": "en",
    "fetchedAt": 1770107758334
  },
  "the wheel of doll|jonathan ames": {
    "description": "In this second installment of a series characterized by \"offbeat humor and unflinching violence\" (NTYBR), the eponymous and hapless detective Happy Doll returns with a new philosophy and a new case; \"Hard-boiled PI fiction set in the present doesn’t get much better.\" (Publishers Weekly, STARRED) • Shamus Award Winner for Best PI Hardcover Novel • Although badly scarred and down to his last kidney after the previous caper, Happy Doll is back in business. When a beguiling young woman turns up at his door, it’s Doll’s past that comes knocking. Mary DeAngelo is searching for her estranged mother, Ines Candle—a singular and troubled woman Doll once loved. The last he’d seen her she’d been near-death: arms slit like envelopes. Although she survived the episode, she vanished shortly thereafter. Now, years later, Mary claims Ines is alive and has recently made contact—messaging her on Facebook and calling her from a burner phone—only to disappear once again. Although his psychoanalyst would discourage it, Doll takes the case, desperate to see Ines again. But as the investigation deepens, there are questions he can’t shake. What’s led the flighty Ines to reappear? Is Mary only relaying half the truth? And who is Mary’s strange and mysterious husband? In this wholly original follow-up to A Man Named Doll, Happy travels through L.A., Washington, Oregon and back again—a journey that gets wilder and woolier with each turn. An irreverent and inventive mystery, The Wheel of Doll is not to be missed.",
    "rating": null,
    "ratingsCount": null,
    "author": "Jonathan Ames",
    "publishedDate": "2022-09-06",
    "publisher": "Mulholland Books",
    "pageCount": 219,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0316288594",
    "isbn13": "9780316288590",
    "language": "en",
    "fetchedAt": 1770107760170
  },
  "bat eater and other names for cora zeng|kylie lee baker": {
    "description": "\"A compelling, gory, ghostly romp.\" —Paul Tremblay, New York Times bestselling author of Horror Movie \"This is what it felt like to live in New York City during lockdown: haunted, absurd, terrifying, ridiculous, and full of hungry ghosts.\" —Grady Hendrix, New York Times bestselling author of How to Sell a Haunted House In this explosive horror novel, a woman is haunted by inner trauma, hungry ghosts, and a serial killer as she confronts the brutal violence experienced by East Asians during the pandemic. Cora Zeng is a crime scene cleaner, washing away the remains of brutal murders and suicides in Chinatown. But none of that seems so terrible when she’s already witnessed the most horrific thing possible: her sister, Delilah, being pushed in front of a train. Before fleeing the scene, the murderer shouted two words: bat eater. So the bloody messes don’t really bother Cora—she’s more bothered by the germs on the subway railing, the bare hands of a stranger, the hidden viruses in every corner, and the bite marks on her coffee table. Of course, ever since Delilah was killed in front of her, Cora can’t be sure what's real and what’s in her head. She pushes away all feelings and ignores the advice of her aunt to prepare for the Hungry Ghost Festival, when the gates of hell open. But she can't ignore the dread in her stomach as she keeps finding bat carcasses at crime scenes, or the scary fact that all her recent cleanups have been the bodies of East Asian women. As Cora will soon learn, you can’t just ignore hungry ghosts. For fans of Stephen Graham Jones and Gretchen Felker-Martin, Bat Eater and Other Names for Cora Zeng is a wildly original, darkly humorous, and subversive contemporary novel from a striking new voice in horror.",
    "rating": null,
    "ratingsCount": null,
    "author": "Kylie Lee Baker",
    "publishedDate": "2025-04-29",
    "publisher": "Harlequin",
    "pageCount": 300,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "0369761154",
    "isbn13": "9780369761156",
    "language": "en",
    "fetchedAt": 1770109825796
  },
  "coffin moon|keith rosson": {
    "description": "From the author of the “exciting, suspenseful, horrifying” (Stephen King) Fever House, a Vietnam veteran and his adopted niece hunt—and are hunted by—the vampire that slaughtered their family. “Grabs you by the throat and doesn’t relent.”—Cassandra Khaw, author of Nothing But Blackened Teeth It’s the winter of 1975, and Portland, Oregon, is all sleet and neon. Duane Minor is back home after a tour in Vietnam, a bartender just trying to stay sober; save his marriage with his wife, Heidi; and connect with his thirteen-year-old niece, Julia, now that he’s responsible for raising her. Things aren’t easy, but Minor is scraping by. Then a vampire walks into his bar and ruins his life. When Minor crosses John Varley, a killer who sleeps during the day beneath loose drifts of earth and grows teeth in the light of the moon, Varley brutally retaliates by murdering Heidi, leaving Minor broken with guilt and Julia filled with rage. What’s left of their splintered family is united by only one desire: vengeance. So begins a furious, frenzied pursuit across the Pacific Northwest and beyond. From grimy alleyways to desolate highways to snow-lashed plains, Minor and Julia are cast into the dark orbit of undead children, silver bullet casters, and the bevy of broken men transfixed by Varley’s ferocity. Everyone’s out for blood. Gritty, unforgettable, and emotionally devastating, Coffin Moon asks what will be left of our humanity when grief transmutes into violence, when monsters wear human faces, and when our thirst for revenge eclipses everything else.",
    "rating": null,
    "ratingsCount": null,
    "author": "Keith Rosson",
    "publishedDate": "2025-09-09",
    "publisher": "Random House",
    "pageCount": 321,
    "genres": [
      "Fiction"
    ],
    "series": null,
    "isbn10": "059373341X",
    "isbn13": "9780593733417",
    "language": "en",
    "fetchedAt": 1770109826672
  },
  "crash landing!|arthur roth": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": "Arthur Roth",
    "publishedDate": "1983",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "isbn10": null,
    "isbn13": null,
    "language": "en",
    "fetchedAt": 1770109934257
  },
  "full speed to a crash landing|": {
    "description": null,
    "rating": null,
    "ratingsCount": null,
    "author": "Arthur Roth",
    "publishedDate": "1983",
    "publisher": null,
    "pageCount": null,
    "genres": null,
    "series": null,
    "language": "en",
    "fetchedAt": 1770110342345
  }
}